app/controllers/coffee_shops_controller.rb

SELECT "coffee_shops".* FROM "coffee_shops"
---
  def index
    @coffee_shops = CoffeeShop.all

INSERT INTO "coffee_shops" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "1111"], ["description", "1111"], ["user_id", 2], ["created_at", "2024-11-17 20:26:49.479709"], ["updated_at", "2024-11-17 20:26:49.479709"]]
---
  def create
    @coffee_shop = current_user.coffee_shops.build(coffee_shop_params)
    if @coffee_shop.save

SELECT "coffee_shops".* FROM "coffee_shops" WHERE "coffee_shops"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def set_coffee_shop
    @coffee_shop = CoffeeShop.find(params[:id])